Repository: 0x90d/videoduplicatefinder
Catalog: DuplicateFinderEngine/Properties/Resources.*.resx
Languages: cs, hu, ru, zh_cn

# ThumbnailsFinished
source: Thumbnails finished in: {0}, processed files: {1:N0}
cs: Miniatury skončeny: {0}, zpracované soubory: {1:N0}
hu: Bélyegképek készítve: {0}, feldolgozott fájlok: {1:N0}
ru: Миниатюры завершены в: {0}, обработанные файлы: {1:N0}
zh_cn: 缩略图已完成：{0}，处理过的文件：{1:N0}

source: Scan stopped
cs: Skenování bylo zastaveno
hu: A vizsgálat leállt
ru: Сканирование остановлено
zh_cn: 扫描停止

source: Scan resumed
cs: Skenování bylo obnoveno
hu: A szkennelés folytatódik
ru: Сканирование возобновлено
zh_cn: 扫描恢复

source: Scan paused
cs: Skenování pozastaveno
hu: Szkennelés szüneteltetve
ru: Сканирование приостановлено
zh_cn: 扫描已暂停

source: Save scanned files to disk ({0:N0} files).
cs: Uložte naskenované soubory na disky ({0:N0} soubory).
hu: Mentse a beolvasott fájlokat lemezre ({0:N0} fájlok).
ru: Сохранить отсканированные файлы на диск (файлы {0:N0}).
zh_cn: 将扫描的文件保存到磁盘（{0:N0}文件）。

# PreviouslyScannedFilesImported
source: Previously scanned files imported. {0:N0} files in {1}
ru: Импортированные ранее отсканированные файлы. {0:N0} файлов в {1}

source: Found previously scanned files, importing...
ru: Нашли ранее отсканированные файлы, импортировали ...
zh_cn: 找到以前扫描的文件，导入...

# FinishedBuildingFileListIn
source: Finished building file list in {0}
cs: Dokončený seznam stavebních souborů v {0}
hu: {0} befejezte az építési fájllistát
ru: Завершенный список файлов сборки в {0}
zh_cn: {0}中的完成建筑文件列表

source: Scan done
cs: Skenování dokončeno
hu: Szkennelés kész
ru: Сканирование выполнено
zh_cn: 扫描完成

source: Start scan
cs: Začni skenovat
hu: Indítsa el a vizsgálatot
ru: Начать сканирование
zh_cn: 开始扫描

source: Building file list...
cs: Seznam stavebních souborů ...
hu: Fájllista építése ...
ru: Создание списка файлов ...
zh_cn: 建立文件列表......

# DuplicatesCheckFinishedIn
source: Duplicates check finished in: {0}
cs: Kontrola duplikátů byla dokončena: {0}
hu: Az ellenőrzések ismétlése: {0}
ru: Проверка дубликатов завершена: {0}
zh_cn: 完成重复检查：{0}

source: Cancellation exception caught!
cs: Výjimka zrušena!
hu: A törlési kivétel elkapott!
ru: Исключение отмены поймано!
zh_cn: 取消异常了！

# SkippedReadonly
source: Skipped (readonly): {0}
cs: Přeskočen (readonly): {0}
hu: Átugrott (csak olvasható): {0}
ru: Пропущено (только чтение): {0}
zh_cn: 跳过（只读）：{0}

# SkippedBlacklist
source: Skipped (blacklist): {0}
cs: Přeskočeno (černá listina): {0}
hu: Átugrott (fekete lista): {0}
ru: Пропущено (черный список): {0}
zh_cn: 跳过（黑名单）：{0}

# SkippedErrorReason
source: Skipped (error): {0}, reason: {1}
cs: Přeskočeno (chyba): {0}, důvod: {1}
hu: Átugrott (hiba): {0}, ok: {1}
ru: Пропущено (ошибка): {0}, причина: {1}
zh_cn: 跳过（错误）：{0}，原因：{1}

# FFProbeException
source: {0} (exit code: {1})
cs: {0} (kód ukončení: {1})
hu: {0} (kilépési kód: {1})
ru: {0} (код выхода: {1})
zh_cn: {0}（退出代码：{1}）

# FFProbeProcessExceededExecutionTimeout
source: FFProbe process exceeded execution timeout ({0}) and was aborted, File: {1}
cs: Proces FFProbe překročil časový limit provedení ({0}) a byl přerušený, Soubor: {1}
hu: Az FFProbe folyamat meghaladta a végrehajtási időtúllépést ({0}), és megszakította a fájlt: {1}
ru: Процесс FFProbe превысил тайм-аут выполнения ({0}) и был прерван, файл: {1}
zh_cn: FFProbe进程超出执行超时（{0}）并中止，文件：{1}

# FFprobeError
source: FFprobe error: {0}, File: {1}
cs: Chyba FFprobe: {0}, Soubor: {1}
hu: FFprobe hiba: {0}, Fájl: {1}
ru: Ошибка FFprobe: {0}, файл: {1}
zh_cn: FFprobe错误：{0}，文件：{1}

source: FFMpeg process was aborted
cs: Proces FFMpeg byl přerušený
hu: Az FFMpeg folyamat megszakadt
ru: Процесс FFMpeg был прерван
zh_cn: FFMpeg进程已中止

# FFMpegTimeoutFile
source: FFMpeg timeout. File: {0}
cs: Časový limit FFMpeg. Soubor: {0}
hu: FFMpeg időtúllépés. Fájl: {0}
ru: Тайм-аут FFMpeg. Файл: {0}
zh_cn: FFMpeg超时。档案：{0}

source: FFMpeg process is already started
cs: Proces FFMpeg je již spuštěn
hu: Az FFMpeg folyamat már megkezdődött
ru: Процесс FFMpeg уже запущен
zh_cn: FFMpeg进程已经启动

# FailedToCopyToReason
source: Failed to copy '{0}' to '{1}', reason: {2}
ru: Не удалось скопировать «{0}» в «{1}», причина: {2}

# FailedToCopyReasonDirectoryDoesNotExist
source: Failed to copy '{0}', reason: Directory does not exist
ru: Не удалось скопировать '{0}', причина: каталог не существует

# DatabaseCleanupHasFinished
source: Database cleanup has finished in: {0}, {1} entries have been removed
ru: Очистка базы данных завершена: {0}, {1} записей было удалено

# DatabaseVideosExportToCSVFinished
source: Database videos export to CSV finished in: {0}
ru: Экспорт видео из базы данных в CSV завершен: {0}
